In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [3]:
obj = Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [5]:
obj['b':'c'] = 10
obj

a     0.0
b    10.0
c    10.0
d     3.0
dtype: float64

In [6]:
data = DataFrame(np.arange(16).reshape(4,4),
                 index = ['Seoul', 'Busan', 'Kwangju', 'Daegu'],
                 columns = ['one', 'two', 'three', 'four'])
data

         one  two  three  four
Seoul      0    1      2     3
Busan      4    5      6     7
Kwangju    8    9     10    11
Daegu     12   13     14    15

In [7]:
data['two']

Seoul       1
Busan       5
Kwangju     9
Daegu      13
Name: two, dtype: int32

In [8]:
data[['one', 'two']]

         one  two
Seoul      0    1
Busan      4    5
Kwangju    8    9
Daegu     12   13

In [11]:
data[2:]

         one  two  three  four
Kwangju    8    9     10    11
Daegu     12   13     14    15

In [13]:
data[data['three'] > 7]

         one  two  three  four
Kwangju    8    9     10    11
Daegu     12   13     14    15

In [15]:
data < 5

           one    two  three   four
Seoul     True   True   True   True
Busan     True  False  False  False
Kwangju  False  False  False  False
Daegu    False  False  False  False

In [16]:
data[data < 5] = 0
data

         one  two  three  four
Seoul      0    0      0     0
Busan      0    5      6     7
Kwangju    8    9     10    11
Daegu     12   13     14    15

- ix 속성 : DataFrame의 특수한 색인 필드(속성)

In [17]:
data.ix['Seoul']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one      0
two      0
three    0
four     0
Name: Seoul, dtype: int32

In [19]:
data.ix['Busan',['two', 'three']]

two      5
three    6
Name: Busan, dtype: int32

In [20]:
data.ix[['Kwangju', 'Daegu'], ['three', 'four']]

         three  four
Kwangju     10    11
Daegu       14    15

In [21]:
data.ix[['Seoul', 'Daegu'], ['three', 'one']]

       three  one
Seoul      0    0
Daegu     14   12

In [23]:
data.ix[['Daegu', 'Kwangju'], [3, 0, 1]]

         four  one  two
Daegu      15   12   13
Kwangju    11    8    9

In [25]:
data.ix[2,3]

11

In [28]:
data.ix[:'Kwangju','three']

Seoul       0
Busan       6
Kwangju    10
Name: three, dtype: int32

In [29]:
data.ix[data.three > 5,:3]

         one  two  three
Busan      0    5      6
Kwangju    8    9     10
Daegu     12   13     14